$(document).ready(function(){
	// sync data ↓
	mp_data = {  // MP3 sync
		////////////
		// P - 66
		data_66_o_15_a: { // 파일명 - 학습목표(1)
			subtitle: [
				[0.6, 2.4, 1],
				[3.6, 6.2, 2]
			]
		},
		data_66_o_17_a: { // 파일명 - 학습목표(2)
			subtitle: [
				[0.6, 3.2, 1],
				[4.2, 6.0, 2],
				[7.0, 8.8, 2]
			]
		},
		data_66_s_26_a: { // 파일명 - get ready - 낱말보기
			subtitle: [
				[0.5, 1.7],
				[2.7, 3.8],
				[4.8, 5.8],
				[6.8, 7.8],
				[9, 9.9],
				[11, 11.9],
				[12.8, 13.9],
				[14.9, 16],
				[16.9, 18.1],
				[19, 20.2],
				[21.2, 22.4],
				[23.5, 24.7],
				[25.8, 27.4],
				[28.4, 29.8],
				[31, 32.5],
				[33.6, 34.9],
				[36, 37.5]
			],
		},



// ***************************************************** //


		data_p010_01: { // 파일명 -
			subtitle: [ // 자막싱크([시작시간, 끝시간, 역할번호(한턴듣기)])
				[6.0, 10.3, 1],
				[10.5, 12.8, 2]
			],
			dialogue: [
				["I’m in the third grade. What grade are you in?", "나는 3학년이야. 너는 몇 학년이니?"],
				["I’m in the second grade.", "나는 2학년이야."],
			],
			scene: [ // 장면 듣기
				[3.5, 6.1],
				[7.9, 10],
				[12.33, 15.6]
			],
		},

		data_11_s_1_a: { // 파일명 - Look and Listen(1)
			subtitle: [
				[1.0, 3.5, 1],
				[4.0, 7.0, 2],
				[7.5, 13.5, 1],
				[14.0, 21.0, 3],
				[22.0, 25.0, 1],
				[26.0, 30.5, 3],
				[31.0, 37.5, 4],
				[38.0, 42.5, 2],
				[43.0, 48.5, 5],
				[49.5, 52.5, 2],
				[53.0, 55.5, 5],
				[56.0, 63.5, 2]
			]
		},

		data_p014_01: { // data_ + sync ID : 012_01_a_01
			subtitle: [
				[9.1, 11.0, 1],
				[11.2, 13.6, 2],
				[13.6, 15.8, 3],
				[15.8, 18.0, 4],
				[18.1, 20.4, 1],
				[21.8, 23.1, "2_3_4"],
				[33.2, 35.2, 5],
				[35.4, 37.6, 6],
				[37.6, 39.7, 7],
				[39.7, 42.0, 8],
				[42.1, 44.2, 5],
				[45.0, 48.2, "6_7_8"]
			],
			dialogue: [
				["What grade are you in?", "너는 몇 학년이니?"],
				["I’m in the first grade.", "나는 1학년이야."],
				["I’m in the second grade.", "나는 2학년이야."],
				["I’m in the third grade.", "나는 3학년이야."],
				["Can you join us?", "우리와 같이 할래?"],
				["All right.", "좋아."],
				["What grade are you in?", "너는 몇 학년이니?"],
				["I’m in the fourth grade.", "나는 4학년이야."],
				["I’m in the fifth grade.", "나는 5학년이야."],
				["I’m in the sixth grade.", "나는 6학년이야."],
				["Can you join us?", "우리와 같이 할래?"],
				["Sorry, I can’t.", "미안, 나는 못 해."]
			],
			scene: [
				[3.5, 6.1],
				[7.9, 10],
				[12.33, 15.6]
			],
		},

		data_p014_01_follow: { // 따라하기파일적용 테스트 용
	        subtitle: [
				[9.1, 13.5, 1],
				[13.6, 18.3, 2],
				[18.4, 22.3, 3],
				[22.4, 27.3, 4],
				[27.4, 31.9, 1],
				[33.4, 39.1, "2_3_4"],
				[48.4, 52.9, 5],
				[53.0, 57.7, 6],
				[57.8, 62.0, 7],
				[62.1, 66.7, 8],
				[66.8, 71.7, 5],
				[72.2, 80.5, "6_7_8"]
	        ],
	        dialogue: [
				["What grade are you in?", "너는 몇 학년이니?"],
				["I’m in the first grade.", "나는 1학년이야."],
				["I’m in the second grade.", "나는 2학년이야."],
				["I’m in the third grade.", "나는 3학년이야."],
				["Can you join us?", "우리와 같이 할래?"],
				["All right.", "좋아."],
				["What grade are you in?", "너는 몇 학년이니?"],
				["I’m in the fourth grade.", "나는 4학년이야."],
				["I’m in the fifth grade.", "나는 5학년이야."],
				["I’m in the sixth grade.", "나는 6학년이야."],
				["Can you join us?", "우리와 같이 할래?"],
				["Sorry, I can’t.", "미안, 나는 못 해."]
			],
			scene: [
				[3.5, 6.1],
				[7.9, 10],
				[12.33, 15.6]
			],
		},
	}
});
